@gthieleb I'm **unable** to reproduce this issue with the following:

- Terraform v1.1.1
- Provider v2.0.2
- vSphere v7.0.2
- CentOS 8 Guest OS


Plan:

```console
❯ terraform plan
vsphere_virtual_machine.vm[0]: Refreshing state... [id=420205d4-dc49-619f-515f-849f1173a593]
vsphere_compute_cluster_vm_affinity_rule.vm_affinity_rule: Refreshing state... [id=domain-c6045:104]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.vsphere_virtual_machine.vms[0] will be read during apply
  # (config refers to values not yet known)
 <= data "vsphere_virtual_machine" "vms"  {
      - annotation                              = "Built by HashiCorp Packer on 2021-11-06 19:34 UTC." -> null
      - boot_delay                              = 0 -> null
      - boot_retry_delay                        = 10000 -> null
      - boot_retry_enabled                      = false -> null
      ~ change_version                          = "2021-12-22T22:18:49.901186Z" -> (known after apply)
      - cpu_hot_add_enabled                     = false -> null
      - cpu_hot_remove_enabled                  = false -> null
      - cpu_limit                               = -1 -> null
      - cpu_performance_counters_enabled        = false -> null
      - cpu_reservation                         = 0 -> null
      ~ cpu_share_count                         = 1000 -> (known after apply)
      - cpu_share_level                         = "normal" -> null
      ~ disks                                   = [
          - {
              - eagerly_scrub    = false
              - label            = "Hard disk 1"
              - size             = 40
              - thin_provisioned = true
              - unit_number      = 0
            },
        ] -> (known after apply)
      - efi_secure_boot_enabled                 = true -> null
      - enable_disk_uuid                        = false -> null
      - enable_logging                          = false -> null
      - ept_rvi_mode                            = "automatic" -> null
      - extra_config                            = {} -> null
      - firmware                                = "efi" -> null
      ~ guest_id                                = "centos8_64Guest" -> (known after apply)
      ~ guest_ip_addresses                      = [
          - "172.16.11.101",
          - "fe80::250:56ff:fe82:6755",
        ] -> (known after apply)
      ~ hardware_version                        = 19 -> (known after apply)
      - hv_mode                                 = "hvAuto" -> null
      ~ id                                      = "420205d4-dc49-619f-515f-849f1173a593" -> (known after apply)
      - ide_controller_scan_count               = 2 -> null
      - latency_sensitivity                     = "normal" -> null
      - memory                                  = 4096 -> null
      - memory_hot_add_enabled                  = false -> null
      - memory_limit                            = -1 -> null
      - memory_reservation                      = 0 -> null
      ~ memory_share_count                      = 40960 -> (known after apply)
      - memory_share_level                      = "normal" -> null
        name                                    = "foo-0"
      - nested_hv_enabled                       = false -> null
      ~ network_interface_types                 = [
          - "vmxnet3",
        ] -> (known after apply)
      ~ network_interfaces                      = [
          - {
              - adapter_type          = "vmxnet3"
              - bandwidth_limit       = -1
              - bandwidth_reservation = 0
              - bandwidth_share_count = 50
              - bandwidth_share_level = "normal"
              - mac_address           = "00:50:56:82:67:55"
              - network_id            = "network-1001"
            },
        ] -> (known after apply)
      - num_cores_per_socket                    = 1 -> null
      - num_cpus                                = 1 -> null
      - run_tools_scripts_after_power_on        = true -> null
      - run_tools_scripts_after_resume          = true -> null
      - run_tools_scripts_before_guest_reboot   = false -> null
      - run_tools_scripts_before_guest_shutdown = true -> null
      - run_tools_scripts_before_guest_standby  = true -> null
      - sata_controller_scan_count              = 0 -> null
      ~ scsi_bus_sharing                        = "noSharing" -> (known after apply)
      - scsi_controller_scan_count              = 1 -> null
      ~ scsi_type                               = "pvscsi" -> (known after apply)
      + storage_policy_id                       = (known after apply)
      - swap_placement_policy                   = "inherit" -> null
      - sync_time_with_host                     = true -> null
      - sync_time_with_host_periodically        = false -> null
      ~ uuid                                    = "420205d4-dc49-619f-515f-849f1173a593" -> (known after apply)
      ~ vapp_transport                          = [] -> (known after apply)
      - vbs_enabled                             = false -> null
      - vvtd_enabled                            = false -> null
        # (1 unchanged attribute hidden)
    }

  # vsphere_virtual_machine.vm[0] will be updated in-place
  ~ resource "vsphere_virtual_machine" "vm" {
      - annotation                              = "Built by HashiCorp Packer on 2021-11-06 19:34 UTC." -> null
        id                                      = "420205d4-dc49-619f-515f-849f1173a593"
        name                                    = "foo-0"
        tags                                    = []
        # (67 unchanged attributes hidden)

      + cdrom {
          + datastore_id = "datastore-12"
          + path         = "iso/linus/rhel-derivative/CentOS-8.4.2105-x86_64-dvd1.iso"
        }



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

Apply: Needs to be Powered Off....

```console
❯ terraform apply --auto-approve
vsphere_virtual_machine.vm[0]: Refreshing state... [id=420205d4-dc49-619f-515f-849f1173a593]
vsphere_compute_cluster_vm_affinity_rule.vm_affinity_rule: Refreshing state... [id=domain-c6045:104]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.vsphere_virtual_machine.vms[0] will be read during apply
  # (config refers to values not yet known)
 <= data "vsphere_virtual_machine" "vms"  {
      - annotation                              = "Built by HashiCorp Packer on 2021-11-06 19:34 UTC." -> null
      - boot_delay                              = 0 -> null
      - boot_retry_delay                        = 10000 -> null
      - boot_retry_enabled                      = false -> null
      ~ change_version                          = "2021-12-22T22:18:49.901186Z" -> (known after apply)
      - cpu_hot_add_enabled                     = false -> null
      - cpu_hot_remove_enabled                  = false -> null
      - cpu_limit                               = -1 -> null
      - cpu_performance_counters_enabled        = false -> null
      - cpu_reservation                         = 0 -> null
      ~ cpu_share_count                         = 1000 -> (known after apply)
      - cpu_share_level                         = "normal" -> null
      ~ disks                                   = [
          - {
              - eagerly_scrub    = false
              - label            = "Hard disk 1"
              - size             = 40
              - thin_provisioned = true
              - unit_number      = 0
            },
        ] -> (known after apply)
      - efi_secure_boot_enabled                 = true -> null
      - enable_disk_uuid                        = false -> null
      - enable_logging                          = false -> null
      - ept_rvi_mode                            = "automatic" -> null
      - extra_config                            = {} -> null
      - firmware                                = "efi" -> null
      ~ guest_id                                = "centos8_64Guest" -> (known after apply)
      ~ guest_ip_addresses                      = [
          - "172.16.11.101",
          - "fe80::250:56ff:fe82:6755",
        ] -> (known after apply)
      ~ hardware_version                        = 19 -> (known after apply)
      - hv_mode                                 = "hvAuto" -> null
      ~ id                                      = "420205d4-dc49-619f-515f-849f1173a593" -> (known after apply)
      - ide_controller_scan_count               = 2 -> null
      - latency_sensitivity                     = "normal" -> null
      - memory                                  = 4096 -> null
      - memory_hot_add_enabled                  = false -> null
      - memory_limit                            = -1 -> null
      - memory_reservation                      = 0 -> null
      ~ memory_share_count                      = 40960 -> (known after apply)
      - memory_share_level                      = "normal" -> null
        name                                    = "foo-0"
      - nested_hv_enabled                       = false -> null
      ~ network_interface_types                 = [
          - "vmxnet3",
        ] -> (known after apply)
      ~ network_interfaces                      = [
          - {
              - adapter_type          = "vmxnet3"
              - bandwidth_limit       = -1
              - bandwidth_reservation = 0
              - bandwidth_share_count = 50
              - bandwidth_share_level = "normal"
              - mac_address           = "00:50:56:82:67:55"
              - network_id            = "network-1001"
            },
        ] -> (known after apply)
      - num_cores_per_socket                    = 1 -> null
      - num_cpus                                = 1 -> null
      - run_tools_scripts_after_power_on        = true -> null
      - run_tools_scripts_after_resume          = true -> null
      - run_tools_scripts_before_guest_reboot   = false -> null
      - run_tools_scripts_before_guest_shutdown = true -> null
      - run_tools_scripts_before_guest_standby  = true -> null
      - sata_controller_scan_count              = 0 -> null
      ~ scsi_bus_sharing                        = "noSharing" -> (known after apply)
      - scsi_controller_scan_count              = 1 -> null
      ~ scsi_type                               = "pvscsi" -> (known after apply)
      + storage_policy_id                       = (known after apply)
      - swap_placement_policy                   = "inherit" -> null
      - sync_time_with_host                     = true -> null
      - sync_time_with_host_periodically        = false -> null
      ~ uuid                                    = "420205d4-dc49-619f-515f-849f1173a593" -> (known after apply)
      ~ vapp_transport                          = [] -> (known after apply)
      - vbs_enabled                             = false -> null
      - vvtd_enabled                            = false -> null
        # (1 unchanged attribute hidden)
    }

  # vsphere_virtual_machine.vm[0] will be updated in-place
  ~ resource "vsphere_virtual_machine" "vm" {
      - annotation                              = "Built by HashiCorp Packer on 2021-11-06 19:34 UTC." -> null
        id                                      = "420205d4-dc49-619f-515f-849f1173a593"
        name                                    = "foo-0"
        tags                                    = []
        # (67 unchanged attributes hidden)

      + cdrom {
          + datastore_id = "datastore-12"
          + path         = "iso/linus/rhel-derivative/CentOS-8.4.2105-x86_64-dvd1.iso"
        }



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
vsphere_virtual_machine.vm[0]: Modifying... [id=420205d4-dc49-619f-515f-849f1173a593]
╷
│ Error: The attempted operation cannot be performed in the current state (Powered on).
│ 
│   with vsphere_virtual_machine.vm[0],
│   on main.tf line 48, in resource "vsphere_virtual_machine" "vm":
│   48: resource "vsphere_virtual_machine" "vm" {
│ 
```

Apply while powered off.

```console
❯ terraform apply --auto-approve
vsphere_virtual_machine.vm[0]: Refreshing state... [id=420205d4-dc49-619f-515f-849f1173a593]
vsphere_compute_cluster_vm_affinity_rule.vm_affinity_rule: Refreshing state... [id=domain-c6045:104]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # vsphere_virtual_machine.vm[0] has changed
  ~ resource "vsphere_virtual_machine" "vm" {
      ~ guest_ip_addresses                      = [
          - "172.16.11.101",
          - "fe80::250:56ff:fe82:6755",
        ]
        id                                      = "420205d4-dc49-619f-515f-849f1173a593"
        name                                    = "foo-0"
        tags                                    = []
      ~ vmware_tools_status                     = "guestToolsRunning" -> "guestToolsNotRunning"
        # (66 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to
undo or respond to these changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.vsphere_virtual_machine.vms[0] will be read during apply
  # (config refers to values not yet known)
 <= data "vsphere_virtual_machine" "vms"  {
      + change_version          = (known after apply)
      + cpu_share_count         = (known after apply)
      + datacenter_id           = "datacenter-3"
      + disks                   = (known after apply)
      + guest_id                = (known after apply)
      + guest_ip_addresses      = (known after apply)
      + hardware_version        = (known after apply)
      + id                      = (known after apply)
      + memory_share_count      = (known after apply)
      + name                    = "foo-0"
      + network_interface_types = (known after apply)
      + network_interfaces      = (known after apply)
      + scsi_bus_sharing        = (known after apply)
      + scsi_type               = (known after apply)
      + storage_policy_id       = (known after apply)
      + uuid                    = (known after apply)
      + vapp_transport          = (known after apply)
    }

  # vsphere_virtual_machine.vm[0] will be updated in-place
  ~ resource "vsphere_virtual_machine" "vm" {
      - annotation                              = "Built by HashiCorp Packer on 2021-11-06 19:34 UTC." -> null
        id                                      = "420205d4-dc49-619f-515f-849f1173a593"
        name                                    = "foo-0"
        tags                                    = []
        # (67 unchanged attributes hidden)

      + cdrom {
          + datastore_id = "datastore-12"
          + path         = "iso/linus/rhel-derivative/CentOS-8.4.2105-x86_64-dvd1.iso"
        }



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
vsphere_virtual_machine.vm[0]: Modifying... [id=420205d4-dc49-619f-515f-849f1173a593]
vsphere_virtual_machine.vm[0]: Still modifying... [id=420205d4-dc49-619f-515f-849f1173a593, 10s elapsed]
vsphere_virtual_machine.vm[0]: Still modifying... [id=420205d4-dc49-619f-515f-849f1173a593, 20s elapsed]
vsphere_virtual_machine.vm[0]: Still modifying... [id=420205d4-dc49-619f-515f-849f1173a593, 30s elapsed]
vsphere_virtual_machine.vm[0]: Still modifying... [id=420205d4-dc49-619f-515f-849f1173a593, 40s elapsed]
vsphere_virtual_machine.vm[0]: Still modifying... [id=420205d4-dc49-619f-515f-849f1173a593, 50s elapsed]
vsphere_virtual_machine.vm[0]: Modifications complete after 59s [id=420205d4-dc49-619f-515f-849f1173a593]
data.vsphere_virtual_machine.vms[0]: Reading...
data.vsphere_virtual_machine.vms[0]: Read complete after 0s [id=420205d4-dc49-619f-515f-849f1173a593]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```

Ryan

`unable-to-repro`